qmk-arterytek/ChibiOS-Contrib/os/common/ext/CMSIS/ArteryTek/AT32F405/at32f405cx.h
/*****************  Bit definition for CRM_APB2LPEN register  *****************/
#define CRM_APB2LPEN_TMR1LPEN_Pos           (0U)
#define CRM_APB2LPEN_TMR1LPEN_Msk           (0x1U << CRM_APB2LPEN_TMR1LPEN_Pos)     /*!< 0x00000001 */
#define CRM_APB2LPEN_TMR1LPEN               CRM_APB2LPEN_TMR1LPEN_Msk               /*!< TMR1 clock enable in sleep mode */
#define CRM_APB2LPEN_USART1LPEN_Pos         (4U)
#define CRM_APB2LPEN_USART1LPEN_Msk         (0x1U << CRM_APB2LPEN_USART1LPEN_Pos)   /*!< 0x00000010 */
#define CRM_APB2LPEN_USART1LPEN             CRM_APB2LPEN_USART1LPEN_Msk             /*!< USART1 clock enable in sleep mode */
#define CRM_APB2LPEN_USART6LPEN_Pos         (5U)
#define CRM_APB2LPEN_USART6LPEN_Msk         (0x1U << CRM_APB2LPEN_USART6LPEN_Pos)   /*!< 0x00000020 */
#define CRM_APB2LPEN_USART6LPEN             CRM_APB2LPEN_USART6LPEN_Msk             /*!< USART6 clock enable in sleep mode */
#define CRM_APB2LPEN_ADC1LPEN_Pos           (8U)
#define CRM_APB2LPEN_ADC1LPEN_Msk           (0x1U << CRM_APB2LPEN_ADC1LPEN_Pos)     /*!< 0x00000100 */
#define CRM_APB2LPEN_ADC1LPEN               CRM_APB2LPEN_ADC1LPEN_Msk               /*!< ADC1 clock enable in sleep mode */
#define CRM_APB2LPEN_SPI1LPEN_Pos           (12U)
#define CRM_APB2LPEN_SPI1LPEN_Msk           (0x1U << CRM_APB2LPEN_SPI1LPEN_Pos)     /*!< 0x00001000 */
#define CRM_APB2LPEN_SPI1LPEN               CRM_APB2LPEN_SPI1LPEN_Msk               /*!< SPI1 clock enable in sleep mode */
#define CRM_APB2LPEN_SCFGLPEN_Pos           (14U)
#define CRM_APB2LPEN_SCFGLPEN_Msk           (0x1U << CRM_APB2LPEN_SCFGLPEN_Pos)     /*!< 0x00004000 */
#define CRM_APB2LPEN_SCFGLPEN               CRM_APB2LPEN_SCFGLPEN_Msk               /*!< SCFG clock enable in sleep mode */
#define CRM_APB2LPEN_TMR9LPEN_Pos           (16U)
#define CRM_APB2LPEN_TMR9LPEN_Msk           (0x1U << CRM_APB2LPEN_TMR9LPEN_Pos)     /*!< 0x00010000 */
#define CRM_APB2LPEN_TMR9LPEN               CRM_APB2LPEN_TMR9LPEN_Msk               /*!< TMR9 clock enable in sleep mode */
#define CRM_APB2LPEN_TMR10LPEN_Pos          (17U)
#define CRM_APB2LPEN_TMR10LPEN_Msk          (0x1U << CRM_APB2LPEN_TMR10LPEN_Pos)    /*!< 0x00020000 */
#define CRM_APB2LPEN_TMR10LPEN              CRM_APB2LPEN_TMR10LPEN_Msk              /*!< TMR10 clock enable in sleep mode */
#define CRM_APB2LPEN_TMR11LPEN_Pos          (18U)
#define CRM_APB2LPEN_TMR11LPEN_Msk          (0x1U << CRM_APB2LPEN_TMR11LPEN_Pos)    /*!< 0x00040000 */
#define CRM_APB2LPEN_TMR11LPEN              CRM_APB2LPEN_TMR11LPEN_Msk              /*!< TMR11 clock enable in sleep mode */
#define CRM_APB2LPEN_I2SF5LPEN_Pos          (20U)
#define CRM_APB2LPEN_I2SF5LPEN_Msk          (0x1U << CRM_APB2LPEN_I2SF5LPEN_Pos)    /*!< 0x00100000 */
#define CRM_APB2LPEN_I2SF5LPEN              CRM_APB2LPEN_I2SF5LPEN_Msk              /*!< I2SF5 clock enable in sleep mode */
#define CRM_APB2LPEN_ACCLPEN_Pos            (29U)
#define CRM_APB2LPEN_ACCLPEN_Msk            (0x1U << CRM_APB2LPEN_ACCLPEN_Pos)      /*!< 0x20000000 */
#define CRM_APB2LPEN_ACCLPEN                CRM_APB2LPEN_ACCLPEN_Msk                /*!< ACC clock enable in sleep mode */
#define CRM_APB2LPEN_OTGHSPHYLPEN_Pos       (31U)
#define CRM_APB2LPEN_OTGHSPHYLPEN_Msk       (0x1U << CRM_APB2LPEN_OTGHSPHYLPEN_Pos) /*!< 0x80000000 */
#define CRM_APB2LPEN_OTGHSPHYLPEN           CRM_APB2LPEN_OTGHSPHYLPEN_Msk           /*!< OTGHS PHY clock enable in sleep mode */

/*******************  Bit definition for CRM_BPDC register  *******************/
#define CRM_BPDC_LEXTEN_Pos                 (0U)
#define CRM_BPDC_LEXTEN_Msk                 (0x1U << CRM_BPDC_LEXTEN_Pos)           /*!< 0x00000001 */
#define CRM_BPDC_LEXTEN                     CRM_BPDC_LEXTEN_Msk                     /*!< External low-speed oscillator enable */
#define CRM_BPDC_LEXTSTBL_Pos               (1U)
#define CRM_BPDC_LEXTSTBL_Msk               (0x1U << CRM_BPDC_LEXTSTBL_Pos)         /*!< 0x00000002 */
#define CRM_BPDC_LEXTSTBL                   CRM_BPDC_LEXTSTBL_Msk                   /*!< External low-speed oscillator stable */
#define CRM_BPDC_LEXTBYPS_Pos               (2U)
#define CRM_BPDC_LEXTBYPS_Msk               (0x1U << CRM_BPDC_LEXTBYPS_Pos)         /*!< 0x00000004 */
#define CRM_BPDC_LEXTBYPS                   CRM_BPDC_LEXTBYPS_Msk                   /*!< External low-speed crystal bypass */

/*!< ERTCSEL congiguration */
#define CRM_BPDC_ERTCSEL_Pos                (8U)
#define CRM_BPDC_ERTCSEL_Msk                (0x3U << CRM_BPDC_ERTCSEL_Pos)          /*!< 0x00000300 */
#define CRM_BPDC_ERTCSEL                    CRM_BPDC_ERTCSEL_Msk                    /*!< ERTCSEL[1:0] bits (ERTC clock selection) */
#define CRM_BPDC_ERTCSEL_0                  (0x1U << CRM_BPDC_ERTCSEL_Pos)          /*!< 0x00000100 */
#define CRM_BPDC_ERTCSEL_1                  (0x2U << CRM_BPDC_ERTCSEL_Pos)          /*!< 0x00000200 */

#define CRM_BPDC_ERTCSEL_NOCLOCK            0x00000000U                             /*!< No clock */
#define CRM_BPDC_ERTCSEL_LEXT               0x00000100U                             /*!< LEXT */
#define CRM_BPDC_ERTCSEL_LICK               0x00000200U                             /*!< LICK */
#define CRM_BPDC_ERTCSEL_HEXT               0x00000300U                             /*!< Devided HEXT with ERTCDIV bit in CRM_CFG */

#define CRM_BPDC_ERTCEN_Pos                 (15U)
#define CRM_BPDC_ERTCEN_Msk                 (0x1U << CRM_BPDC_ERTCEN_Pos)           /*!< 0x00008000 */
#define CRM_BPDC_ERTCEN                     CRM_BPDC_ERTCEN_Msk                     /*!< ERTC clock enable */
#define CRM_BPDC_BPDRST_Pos                 (16U)
#define CRM_BPDC_BPDRST_Msk                 (0x1U << CRM_BPDC_BPDRST_Pos)           /*!< 0x00010000 */
#define CRM_BPDC_BPDRST                     CRM_BPDC_BPDRST_Msk                     /*!< Battery powered domain software reset */

/*****************  Bit definition for CRM_CTRLSTS register  ******************/
#define CRM_CTRLSTS_LICKEN_Pos              (0U)
#define CRM_CTRLSTS_LICKEN_Msk              (0x1U << CRM_CTRLSTS_LICKEN_Pos)        /*!< 0x00000001 */
#define CRM_CTRLSTS_LICKEN                  CRM_CTRLSTS_LICKEN_Msk                  /*!< LICK enable */
#define CRM_CTRLSTS_LICKSTBL_Pos            (1U)
#define CRM_CTRLSTS_LICKSTBL_Msk            (0x1U << CRM_CTRLSTS_LICKSTBL_Pos)      /*!< 0x00000002 */
#define CRM_CTRLSTS_LICKSTBL                CRM_CTRLSTS_LICKSTBL_Msk                /*!< LICK stable */
#define CRM_CTRLSTS_RSTFC_Pos               (24U)
#define CRM_CTRLSTS_RSTFC_Msk               (0x1U << CRM_CTRLSTS_RSTFC_Pos)         /*!< 0x01000000 */
#define CRM_CTRLSTS_RSTFC                   CRM_CTRLSTS_RSTFC_Msk                   /*!< Reset flag clear */
#define CRM_CTRLSTS_NRSTF_Pos               (26U)
#define CRM_CTRLSTS_NRSTF_Msk               (0x1U << CRM_CTRLSTS_NRSTF_Pos)         /*!< 0x04000000 */
#define CRM_CTRLSTS_NRSTF                   CRM_CTRLSTS_NRSTF_Msk                   /*!< NRST pin reset flag */
#define CRM_CTRLSTS_PORRSTF_Pos             (27U)
#define CRM_CTRLSTS_PORRSTF_Msk             (0x1U << CRM_CTRLSTS_PORRSTF_Pos)       /*!< 0x08000000 */
#define CRM_CTRLSTS_PORRSTF                 CRM_CTRLSTS_PORRSTF_Msk                 /*!< POR/LVR reset flag */
#define CRM_CTRLSTS_SWRSTF_Pos              (28U)
#define CRM_CTRLSTS_SWRSTF_Msk              (0x1U << CRM_CTRLSTS_SWRSTF_Pos)        /*!< 0x10000000 */
#define CRM_CTRLSTS_SWRSTF                  CRM_CTRLSTS_SWRSTF_Msk                  /*!< Software reset flag */
#define CRM_CTRLSTS_WDTRSTF_Pos             (29U)
#define CRM_CTRLSTS_WDTRSTF_Msk             (0x1U << CRM_CTRLSTS_WDTRSTF_Pos)       /*!< 0x20000000 */
#define CRM_CTRLSTS_WDTRSTF                 CRM_CTRLSTS_WDTRSTF_Msk                 /*!< Watchdog timer reset flag */
#define CRM_CTRLSTS_WWDTRSTF_Pos            (30U)
#define CRM_CTRLSTS_WWDTRSTF_Msk            (0x1U << CRM_CTRLSTS_WWDTRSTF_Pos)      /*!< 0x40000000 */
#define CRM_CTRLSTS_WWDTRSTF                CRM_CTRLSTS_WWDTRSTF_Msk                /*!< Window watchdog timer reset flag */
#define CRM_CTRLSTS_LPRSTF_Pos              (31U)
#define CRM_CTRLSTS_LPRSTF_Msk              (0x1U << CRM_CTRLSTS_LPRSTF_Pos)        /*!< 0x80000000 */
#define CRM_CTRLSTS_LPRSTF                  CRM_CTRLSTS_LPRSTF_Msk                  /*!< Low-power reset flag */

/******************  Bit definition for CRM_OTGHS register  *******************/
#define CRM_OTGHS_USBHS_PHY12_SEL_Pos       (4U)
#define CRM_OTGHS_USBHS_PHY12_SEL_Msk       (0x1U << CRM_OTGHS_USBHS_PHY12_SEL_Pos) /*!< 0x00000010 */
#define CRM_OTGHS_USBHS_PHY12_SEL           CRM_OTGHS_USBHS_PHY12_SEL_Msk           /*!< USBHS PHY 12M clock source select */

/******************  Bit definition for CRM_MISC1 register  *******************/
#define CRM_MISC1_HICKCAL_KEY_Pos           (0U)
#define CRM_MISC1_HICKCAL_KEY_Msk           (0xFFU << CRM_MISC1_HICKCAL_KEY_Pos)    /*!< 0x000000FF */
#define CRM_MISC1_HICKCAL_KEY               CRM_MISC1_HICKCAL_KEY_Msk               /*!< HICK calibration key */
#define CRM_MISC1_HICKDIV_Pos               (12U)
#define CRM_MISC1_HICKDIV_Msk               (0x1U << CRM_MISC1_HICKDIV_Pos)         /*!< 0x00001000 */
#define CRM_MISC1_HICKDIV                   CRM_MISC1_HICKDIV_Msk                   /*!< HICK 6 divider selection */
#define CRM_MISC1_HICK_TO_SCLK_Pos          (14U)
#define CRM_MISC1_HICK_TO_SCLK_Msk          (0x1U << CRM_MISC1_HICK_TO_SCLK_Pos)    /*!< 0x00004000 */
#define CRM_MISC1_HICK_TO_SCLK              CRM_MISC1_HICK_TO_SCLK_Msk              /*!< HICK as system clock frequency select */
#define CRM_MISC1_HICKRST_Pos               (15U)
#define CRM_MISC1_HICKRST_Msk               (0x1U << CRM_MISC1_HICKRST_Pos)         /*!< 0x00008000 */
#define CRM_MISC1_HICKRST                   CRM_MISC1_HICKRST_Msk                   /*!< HICKRST */

