qmk-arterytek/ChibiOS-Contrib/os/common/ext/CMSIS/ArteryTek/AT32F405/at32f405cx.h
/*!< ODRV7 configuration */
#define GPIO_ODRVR_ODRV7_Pos                (14U)
#define GPIO_ODRVR_ODRV7_Msk                (0x3U << GPIO_ODRVR_ODRV7_Pos)          /*!< 0x0000C000 */
#define GPIO_ODRVR_ODRV7                    GPIO_ODRVR_ODRV7_Msk                    /*!< ODRV7[1:0] bits (GPIO x drive capability, pin 7) */
#define GPIO_ODRVR_ODRV7_0                  (0x1U << GPIO_ODRVR_ODRV7_Pos)          /*!< 0x00004000 */
#define GPIO_ODRVR_ODRV7_1                  (0x2U << GPIO_ODRVR_ODRV7_Pos)          /*!< 0x00008000 */

/*!< ODRV8 configuration */
#define GPIO_ODRVR_ODRV8_Pos                (16U)
#define GPIO_ODRVR_ODRV8_Msk                (0x3U << GPIO_ODRVR_ODRV8_Pos)          /*!< 0x00030000 */
#define GPIO_ODRVR_ODRV8                    GPIO_ODRVR_ODRV8_Msk                    /*!< ODRV8[1:0] bits (GPIO x drive capability, pin 8) */
#define GPIO_ODRVR_ODRV8_0                  (0x1U << GPIO_ODRVR_ODRV8_Pos)          /*!< 0x00010000 */
#define GPIO_ODRVR_ODRV8_1                  (0x2U << GPIO_ODRVR_ODRV8_Pos)          /*!< 0x00020000 */

/*!< ODRV9 configuration */
#define GPIO_ODRVR_ODRV9_Pos                (18U)
#define GPIO_ODRVR_ODRV9_Msk                (0x3U << GPIO_ODRVR_ODRV9_Pos)          /*!< 0x000C0000 */
#define GPIO_ODRVR_ODRV9                    GPIO_ODRVR_ODRV9_Msk                    /*!< ODRV9[1:0] bits (GPIO x drive capability, pin 9) */
#define GPIO_ODRVR_ODRV9_0                  (0x1U << GPIO_ODRVR_ODRV9_Pos)          /*!< 0x00040000 */
#define GPIO_ODRVR_ODRV9_1                  (0x2U << GPIO_ODRVR_ODRV9_Pos)          /*!< 0x00080000 */

/*!< ODRV10 configuration */
#define GPIO_ODRVR_ODRV10_Pos               (20U)
#define GPIO_ODRVR_ODRV10_Msk               (0x3U << GPIO_ODRVR_ODRV10_Pos)         /*!< 0x00300000 */
#define GPIO_ODRVR_ODRV10                   GPIO_ODRVR_ODRV10_Msk                   /*!< ODRV10[1:0] bits (GPIO x drive capability, pin 10) */
#define GPIO_ODRVR_ODRV10_0                 (0x1U << GPIO_ODRVR_ODRV10_Pos)         /*!< 0x00100000 */
#define GPIO_ODRVR_ODRV10_1                 (0x2U << GPIO_ODRVR_ODRV10_Pos)         /*!< 0x00200000 */

/*!< ODRV11 configuration */
#define GPIO_ODRVR_ODRV11_Pos               (22U)
#define GPIO_ODRVR_ODRV11_Msk               (0x3U << GPIO_ODRVR_ODRV11_Pos)         /*!< 0x00C00000 */
#define GPIO_ODRVR_ODRV11                   GPIO_ODRVR_ODRV11_Msk                   /*!< ODRV11[1:0] bits (GPIO x drive capability, pin 11) */
#define GPIO_ODRVR_ODRV11_0                 (0x1U << GPIO_ODRVR_ODRV11_Pos)         /*!< 0x00400000 */
#define GPIO_ODRVR_ODRV11_1                 (0x2U << GPIO_ODRVR_ODRV11_Pos)         /*!< 0x00800000 */

/*!< ODRV12 configuration */
#define GPIO_ODRVR_ODRV12_Pos               (24U)
#define GPIO_ODRVR_ODRV12_Msk               (0x3U << GPIO_ODRVR_ODRV12_Pos)         /*!< 0x03000000 */
#define GPIO_ODRVR_ODRV12                   GPIO_ODRVR_ODRV12_Msk                   /*!< ODRV12[1:0] bits (GPIO x drive capability, pin 12) */
#define GPIO_ODRVR_ODRV12_0                 (0x1U << GPIO_ODRVR_ODRV12_Pos)         /*!< 0x01000000 */
#define GPIO_ODRVR_ODRV12_1                 (0x2U << GPIO_ODRVR_ODRV12_Pos)         /*!< 0x02000000 */

/*!< ODRV13 configuration */
#define GPIO_ODRVR_ODRV13_Pos               (26U)
#define GPIO_ODRVR_ODRV13_Msk               (0x3U << GPIO_ODRVR_ODRV13_Pos)         /*!< 0x0C000000 */
#define GPIO_ODRVR_ODRV13                   GPIO_ODRVR_ODRV13_Msk                   /*!< ODRV13[1:0] bits (GPIO x drive capability, pin 13) */
#define GPIO_ODRVR_ODRV13_0                 (0x1U << GPIO_ODRVR_ODRV13_Pos)         /*!< 0x04000000 */
#define GPIO_ODRVR_ODRV13_1                 (0x2U << GPIO_ODRVR_ODRV13_Pos)         /*!< 0x08000000 */

/*!< ODRV14 configuration */
#define GPIO_ODRVR_ODRV14_Pos               (28U)
#define GPIO_ODRVR_ODRV14_Msk               (0x3U << GPIO_ODRVR_ODRV14_Pos)         /*!< 0x30000000 */
#define GPIO_ODRVR_ODRV14                   GPIO_ODRVR_ODRV14_Msk                   /*!< ODRV14[1:0] bits (GPIO x drive capability, pin 14) */
#define GPIO_ODRVR_ODRV14_0                 (0x1U << GPIO_ODRVR_ODRV14_Pos)         /*!< 0x10000000 */
#define GPIO_ODRVR_ODRV14_1                 (0x2U << GPIO_ODRVR_ODRV14_Pos)         /*!< 0x20000000 */

/*!< ODRV15 configuration */
#define GPIO_ODRVR_ODRV15_Pos               (30U)
#define GPIO_ODRVR_ODRV15_Msk               (0x3U << GPIO_ODRVR_ODRV15_Pos)         /*!< 0xC0000000 */
#define GPIO_ODRVR_ODRV15                   GPIO_ODRVR_ODRV15_Msk                   /*!< ODRV15[1:0] bits (GPIO x drive capability, pin 15) */
#define GPIO_ODRVR_ODRV15_0                 (0x1U << GPIO_ODRVR_ODRV15_Pos)         /*!< 0x40000000 */
#define GPIO_ODRVR_ODRV15_1                 (0x2U << GPIO_ODRVR_ODRV15_Pos)         /*!< 0x80000000 */

/*!<***************  Bit definition for GPIO_PULL register  *******************/
#define GPIO_PULL_PULL_Pos                  (0U)
#define GPIO_PULL_PULL_Msk                  (0xFFFFFFFFU << GPIO_PULL_PULL_Pos)     /*!< 0xFFFFFFFF */
#define GPIO_PULL_PULL                      GPIO_PULL_PULL_Msk                      /*!< GPIO x pull-up/pull-down configuration */

/*!< PULL0 configuration */
#define GPIO_PULL_PULL0_Pos                 (0U)
#define GPIO_PULL_PULL0_Msk                 (0x3U << GPIO_PULL_PULL0_Pos)           /*!< 0x00000003 */
#define GPIO_PULL_PULL0                     GPIO_PULL_PULL0_Msk                     /*!< PULL0[1:0] bits (GPIO x pull-up/pull-down configuration, pin 0) */
#define GPIO_PULL_PULL0_0                   (0x1U << GPIO_PULL_PULL0_Pos)           /*!< 0x00000001 */
#define GPIO_PULL_PULL0_1                   (0x2U << GPIO_PULL_PULL0_Pos)           /*!< 0x00000002 */

/*!< PULL1 configuration */
#define GPIO_PULL_PULL1_Pos                 (2U)
#define GPIO_PULL_PULL1_Msk                 (0x3U << GPIO_PULL_PULL1_Pos)           /*!< 0x0000000C */
#define GPIO_PULL_PULL1                     GPIO_PULL_PULL1_Msk                     /*!< PULL1[1:0] bits (GPIO x pull-up/pull-down configuration, pin 1) */
#define GPIO_PULL_PULL1_0                   (0x1U << GPIO_PULL_PULL1_Pos)           /*!< 0x00000004 */
#define GPIO_PULL_PULL1_1                   (0x2U << GPIO_PULL_PULL1_Pos)           /*!< 0x00000008 */

