qmk-arterytek/ChibiOS-Contrib/os/common/ext/CMSIS/ArteryTek/AT32F405/at32f405cx.h
/****************  Bit definition for EXINT_POLCFG1 register  *****************/
#define EXINT_POLCFG1_RP0_Pos               (0U)
#define EXINT_POLCFG1_RP0_Msk               (0x1U << EXINT_POLCFG1_RP0_Pos)         /*!< 0x00000001 */
#define EXINT_POLCFG1_RP0                   EXINT_POLCFG1_RP0_Msk                   /*!< Rising edge event configuration bit on line 0 */
#define EXINT_POLCFG1_RP1_Pos               (1U)
#define EXINT_POLCFG1_RP1_Msk               (0x1U << EXINT_POLCFG1_RP1_Pos)         /*!< 0x00000002 */
#define EXINT_POLCFG1_RP1                   EXINT_POLCFG1_RP1_Msk                   /*!< Rising edge event configuration bit on line 1 */
#define EXINT_POLCFG1_RP2_Pos               (2U)
#define EXINT_POLCFG1_RP2_Msk               (0x1U << EXINT_POLCFG1_RP2_Pos)         /*!< 0x00000004 */
#define EXINT_POLCFG1_RP2                   EXINT_POLCFG1_RP2_Msk                   /*!< Rising edge event configuration bit on line 2 */
#define EXINT_POLCFG1_RP3_Pos               (3U)
#define EXINT_POLCFG1_RP3_Msk               (0x1U << EXINT_POLCFG1_RP3_Pos)         /*!< 0x00000008 */
#define EXINT_POLCFG1_RP3                   EXINT_POLCFG1_RP3_Msk                   /*!< Rising edge event configuration bit on line 3 */
#define EXINT_POLCFG1_RP4_Pos               (4U)
#define EXINT_POLCFG1_RP4_Msk               (0x1U << EXINT_POLCFG1_RP4_Pos)         /*!< 0x00000010 */
#define EXINT_POLCFG1_RP4                   EXINT_POLCFG1_RP4_Msk                   /*!< Rising edge event configuration bit on line 4 */
#define EXINT_POLCFG1_RP5_Pos               (5U)
#define EXINT_POLCFG1_RP5_Msk               (0x1U << EXINT_POLCFG1_RP5_Pos)         /*!< 0x00000020 */
#define EXINT_POLCFG1_RP5                   EXINT_POLCFG1_RP5_Msk                   /*!< Rising edge event configuration bit on line 5 */
#define EXINT_POLCFG1_RP6_Pos               (6U)
#define EXINT_POLCFG1_RP6_Msk               (0x1U << EXINT_POLCFG1_RP6_Pos)         /*!< 0x00000040 */
#define EXINT_POLCFG1_RP6                   EXINT_POLCFG1_RP6_Msk                   /*!< Rising edge event configuration bit on line 6 */
#define EXINT_POLCFG1_RP7_Pos               (7U)
#define EXINT_POLCFG1_RP7_Msk               (0x1U << EXINT_POLCFG1_RP7_Pos)         /*!< 0x00000080 */
#define EXINT_POLCFG1_RP7                   EXINT_POLCFG1_RP7_Msk                   /*!< Rising edge event configuration bit on line 7 */
#define EXINT_POLCFG1_RP8_Pos               (8U)
#define EXINT_POLCFG1_RP8_Msk               (0x1U << EXINT_POLCFG1_RP8_Pos)         /*!< 0x00000100 */
#define EXINT_POLCFG1_RP8                   EXINT_POLCFG1_RP8_Msk                   /*!< Rising edge event configuration bit on line 8 */
#define EXINT_POLCFG1_RP9_Pos               (9U)
#define EXINT_POLCFG1_RP9_Msk               (0x1U << EXINT_POLCFG1_RP9_Pos)         /*!< 0x00000200 */
#define EXINT_POLCFG1_RP9                   EXINT_POLCFG1_RP9_Msk                   /*!< Rising edge event configuration bit on line 9 */
#define EXINT_POLCFG1_RP10_Pos              (10U)
#define EXINT_POLCFG1_RP10_Msk              (0x1U << EXINT_POLCFG1_RP10_Pos)        /*!< 0x00000400 */
#define EXINT_POLCFG1_RP10                  EXINT_POLCFG1_RP10_Msk                  /*!< Rising edge event configuration bit on line 10 */
#define EXINT_POLCFG1_RP11_Pos              (11U)
#define EXINT_POLCFG1_RP11_Msk              (0x1U << EXINT_POLCFG1_RP11_Pos)        /*!< 0x00000800 */
#define EXINT_POLCFG1_RP11                  EXINT_POLCFG1_RP11_Msk                  /*!< Rising edge event configuration bit on line 11 */
#define EXINT_POLCFG1_RP12_Pos              (12U)
#define EXINT_POLCFG1_RP12_Msk              (0x1U << EXINT_POLCFG1_RP12_Pos)        /*!< 0x00001000 */
#define EXINT_POLCFG1_RP12                  EXINT_POLCFG1_RP12_Msk                  /*!< Rising edge event configuration bit on line 12 */
#define EXINT_POLCFG1_RP13_Pos              (13U)
#define EXINT_POLCFG1_RP13_Msk              (0x1U << EXINT_POLCFG1_RP13_Pos)        /*!< 0x00002000 */
#define EXINT_POLCFG1_RP13                  EXINT_POLCFG1_RP13_Msk                  /*!< Rising edge event configuration bit on line 13 */
#define EXINT_POLCFG1_RP14_Pos              (14U)
#define EXINT_POLCFG1_RP14_Msk              (0x1U << EXINT_POLCFG1_RP14_Pos)        /*!< 0x00004000 */
#define EXINT_POLCFG1_RP14                  EXINT_POLCFG1_RP14_Msk                  /*!< Rising edge event configuration bit on line 14 */
#define EXINT_POLCFG1_RP15_Pos              (15U)
#define EXINT_POLCFG1_RP15_Msk              (0x1U << EXINT_POLCFG1_RP15_Pos)        /*!< 0x00008000 */
#define EXINT_POLCFG1_RP15                  EXINT_POLCFG1_RP15_Msk                  /*!< Rising edge event configuration bit on line 15 */
#define EXINT_POLCFG1_RP16_Pos              (16U)
#define EXINT_POLCFG1_RP16_Msk              (0x1U << EXINT_POLCFG1_RP16_Pos)        /*!< 0x00010000 */
#define EXINT_POLCFG1_RP16                  EXINT_POLCFG1_RP16_Msk                  /*!< Rising edge event configuration bit on line 16 */
#define EXINT_POLCFG1_RP17_Pos              (17U)
#define EXINT_POLCFG1_RP17_Msk              (0x1U << EXINT_POLCFG1_RP17_Pos)        /*!< 0x00020000 */
#define EXINT_POLCFG1_RP17                  EXINT_POLCFG1_RP17_Msk                  /*!< Rising edge event configuration bit on line 17 */
#define EXINT_POLCFG1_RP18_Pos              (18U)
#define EXINT_POLCFG1_RP18_Msk              (0x1U << EXINT_POLCFG1_RP18_Pos)        /*!< 0x00040000 */
#define EXINT_POLCFG1_RP18                  EXINT_POLCFG1_RP18_Msk                  /*!< Rising edge event configuration bit on line 18 */
#define EXINT_POLCFG1_RP20_Pos              (20U)
#define EXINT_POLCFG1_RP20_Msk              (0x1U << EXINT_POLCFG1_RP20_Pos)        /*!< 0x00100000 */
#define EXINT_POLCFG1_RP20                  EXINT_POLCFG1_RP20_Msk                  /*!< Rising edge event configuration bit on line 20 */
#define EXINT_POLCFG1_RP21_Pos              (21U)
#define EXINT_POLCFG1_RP21_Msk              (0x1U << EXINT_POLCFG1_RP21_Pos)        /*!< 0x00200000 */
#define EXINT_POLCFG1_RP21                  EXINT_POLCFG1_RP21_Msk                  /*!< Rising edge event configuration bit on line 21 */
#define EXINT_POLCFG1_RP22_Pos              (22U)
#define EXINT_POLCFG1_RP22_Msk              (0x1U << EXINT_POLCFG1_RP22_Pos)        /*!< 0x00400000 */
#define EXINT_POLCFG1_RP22                  EXINT_POLCFG1_RP22_Msk                  /*!< Rising edge event configuration bit on line 22 */

/* References Defines */
#define EXINT_POLCFG1_POL0                  EXINT_POLCFG1_RP0
#define EXINT_POLCFG1_POL1                  EXINT_POLCFG1_RP1
#define EXINT_POLCFG1_POL2                  EXINT_POLCFG1_RP2
#define EXINT_POLCFG1_POL3                  EXINT_POLCFG1_RP3
#define EXINT_POLCFG1_POL4                  EXINT_POLCFG1_RP4
#define EXINT_POLCFG1_POL5                  EXINT_POLCFG1_RP5
#define EXINT_POLCFG1_POL6                  EXINT_POLCFG1_RP6
#define EXINT_POLCFG1_POL7                  EXINT_POLCFG1_RP7
#define EXINT_POLCFG1_POL8                  EXINT_POLCFG1_RP8
#define EXINT_POLCFG1_POL9                  EXINT_POLCFG1_RP9
#define EXINT_POLCFG1_POL10                 EXINT_POLCFG1_RP10
#define EXINT_POLCFG1_POL11                 EXINT_POLCFG1_RP11
#define EXINT_POLCFG1_POL12                 EXINT_POLCFG1_RP12
#define EXINT_POLCFG1_POL13                 EXINT_POLCFG1_RP13
#define EXINT_POLCFG1_POL14                 EXINT_POLCFG1_RP14
#define EXINT_POLCFG1_POL15                 EXINT_POLCFG1_RP15
#define EXINT_POLCFG1_POL16                 EXINT_POLCFG1_RP16
#define EXINT_POLCFG1_POL17                 EXINT_POLCFG1_RP17
#define EXINT_POLCFG1_POL18                 EXINT_POLCFG1_RP18
#define EXINT_POLCFG1_POL20                 EXINT_POLCFG1_RP20
#define EXINT_POLCFG1_POL21                 EXINT_POLCFG1_RP21
#define EXINT_POLCFG1_POL22                 EXINT_POLCFG1_RP22

