qmk-arterytek/ChibiOS-Contrib/os/common/ext/CMSIS/ArteryTek/AT32F405/at32f405cx.h
/*!< TMLPF congiguration */
#define CAN_TSTS_TMLPF_Pos                  (29U)
#define CAN_TSTS_TMLPF_Msk                  (0x7U << CAN_TSTS_TMLPF_Pos)            /*!< 0xE0000000 */
#define CAN_TSTS_TMLPF                      CAN_TSTS_TMLPF_Msk                      /*!< TMLPF[2:0] bits (Transmit mailbox lowest priority flag) */
#define CAN_TSTS_TM0LPF_Pos                 (29U)
#define CAN_TSTS_TM0LPF_Msk                 (0x1U << CAN_TSTS_TM0LPF_Pos)           /*!< 0x20000000 */
#define CAN_TSTS_TM0LPF                     CAN_TSTS_TM0LPF_Msk                     /*!< Transmit mailbox 0 lowest priority flag */
#define CAN_TSTS_TM1LPF_Pos                 (30U)
#define CAN_TSTS_TM1LPF_Msk                 (0x1U << CAN_TSTS_TM1LPF_Pos)           /*!< 0x40000000 */
#define CAN_TSTS_TM1LPF                     CAN_TSTS_TM1LPF_Msk                     /*!< Transmit mailbox 1 lowest priority flag */
#define CAN_TSTS_TM2LPF_Pos                 (31U)
#define CAN_TSTS_TM2LPF_Msk                 (0x1U << CAN_TSTS_TM2LPF_Pos)           /*!< 0x80000000 */
#define CAN_TSTS_TM2LPF                     CAN_TSTS_TM2LPF_Msk                     /*!< Transmit mailbox 2 lowest priority flag */

/*******************  Bit definition for CAN_RF0 register  ********************/
#define CAN_RF0_RF0MN_Pos                   (0U)
#define CAN_RF0_RF0MN_Msk                   (0x3U << CAN_RF0_RF0MN_Pos)             /*!< 0x00000003 */
#define CAN_RF0_RF0MN                       CAN_RF0_RF0MN_Msk                       /*!< Receive FIFO 0 message num */
#define CAN_RF0_RF0FF_Pos                   (3U)
#define CAN_RF0_RF0FF_Msk                   (0x1U << CAN_RF0_RF0FF_Pos)             /*!< 0x00000008 */
#define CAN_RF0_RF0FF                       CAN_RF0_RF0FF_Msk                       /*!< Receive FIFO 0 full flag */
#define CAN_RF0_RF0OF_Pos                   (4U)
#define CAN_RF0_RF0OF_Msk                   (0x1U << CAN_RF0_RF0OF_Pos)             /*!< 0x00000010 */
#define CAN_RF0_RF0OF                       CAN_RF0_RF0OF_Msk                       /*!< Receive FIFO 0 overflow flag */
#define CAN_RF0_RF0R_Pos                    (5U)
#define CAN_RF0_RF0R_Msk                    (0x1U << CAN_RF0_RF0R_Pos)              /*!< 0x00000020 */
#define CAN_RF0_RF0R                        CAN_RF0_RF0R_Msk                        /*!< Receive FIFO 0 release */

/*******************  Bit definition for CAN_RF1 register  ********************/
#define CAN_RF1_RF1MN_Pos                   (0U)
#define CAN_RF1_RF1MN_Msk                   (0x3U << CAN_RF1_RF1MN_Pos)             /*!< 0x00000003 */
#define CAN_RF1_RF1MN                       CAN_RF1_RF1MN_Msk                       /*!< Receive FIFO 1 message num */
#define CAN_RF1_RF1FF_Pos                   (3U)
#define CAN_RF1_RF1FF_Msk                   (0x1U << CAN_RF1_RF1FF_Pos)             /*!< 0x00000008 */
#define CAN_RF1_RF1FF                       CAN_RF1_RF1FF_Msk                       /*!< Receive FIFO 1 full flag */
#define CAN_RF1_RF1OF_Pos                   (4U)
#define CAN_RF1_RF1OF_Msk                   (0x1U << CAN_RF1_RF1OF_Pos)             /*!< 0x00000010 */
#define CAN_RF1_RF1OF                       CAN_RF1_RF1OF_Msk                       /*!< Receive FIFO 1 overflow flag */
#define CAN_RF1_RF1R_Pos                    (5U)
#define CAN_RF1_RF1R_Msk                    (0x1U << CAN_RF1_RF1R_Pos)              /*!< 0x00000020 */
#define CAN_RF1_RF1R                        CAN_RF1_RF1R_Msk                        /*!< Receive FIFO 1 release */

/******************  Bit definition for CAN_INTEN register  *******************/
#define CAN_INTEN_TCIEN_Pos                 (0U)
#define CAN_INTEN_TCIEN_Msk                 (0x1U << CAN_INTEN_TCIEN_Pos)           /*!< 0x00000001 */
#define CAN_INTEN_TCIEN                     CAN_INTEN_TCIEN_Msk                     /*!< Transmit mailbox empty interrupt enable */
#define CAN_INTEN_RF0MIEN_Pos               (1U)
#define CAN_INTEN_RF0MIEN_Msk               (0x1U << CAN_INTEN_RF0MIEN_Pos)         /*!< 0x00000002 */
#define CAN_INTEN_RF0MIEN                   CAN_INTEN_RF0MIEN_Msk                   /*!< FIFO 0 receive message interrupt enable */
#define CAN_INTEN_RF0FIEN_Pos               (2U)
#define CAN_INTEN_RF0FIEN_Msk               (0x1U << CAN_INTEN_RF0FIEN_Pos)         /*!< 0x00000004 */
#define CAN_INTEN_RF0FIEN                   CAN_INTEN_RF0FIEN_Msk                   /*!< Receive FIFO 0 full interrupt enable */
#define CAN_INTEN_RF0OIEN_Pos               (3U)
#define CAN_INTEN_RF0OIEN_Msk               (0x1U << CAN_INTEN_RF0OIEN_Pos)         /*!< 0x00000008 */
#define CAN_INTEN_RF0OIEN                   CAN_INTEN_RF0OIEN_Msk                   /*!< Receive FIFO 0 overflow interrupt enable */
#define CAN_INTEN_RF1MIEN_Pos               (4U)
#define CAN_INTEN_RF1MIEN_Msk               (0x1U << CAN_INTEN_RF1MIEN_Pos)         /*!< 0x00000010 */
#define CAN_INTEN_RF1MIEN                   CAN_INTEN_RF1MIEN_Msk                   /*!< FIFO 1 receive message interrupt enable */
#define CAN_INTEN_RF1FIEN_Pos               (5U)
#define CAN_INTEN_RF1FIEN_Msk               (0x1U << CAN_INTEN_RF1FIEN_Pos)         /*!< 0x00000020 */
#define CAN_INTEN_RF1FIEN                   CAN_INTEN_RF1FIEN_Msk                   /*!< Receive FIFO 1 full interrupt enable */
#define CAN_INTEN_RF1OIEN_Pos               (6U)
#define CAN_INTEN_RF1OIEN_Msk               (0x1U << CAN_INTEN_RF1OIEN_Pos)         /*!< 0x00000040 */
#define CAN_INTEN_RF1OIEN                   CAN_INTEN_RF1OIEN_Msk                   /*!< Receive FIFO 1 overflow interrupt enable */
#define CAN_INTEN_EAIEN_Pos                 (8U)
#define CAN_INTEN_EAIEN_Msk                 (0x1U << CAN_INTEN_EAIEN_Pos)           /*!< 0x00000100 */
#define CAN_INTEN_EAIEN                     CAN_INTEN_EAIEN_Msk                     /*!< Error active interrupt enable */
#define CAN_INTEN_EPIEN_Pos                 (9U)
#define CAN_INTEN_EPIEN_Msk                 (0x1U << CAN_INTEN_EPIEN_Pos)           /*!< 0x00000200 */
#define CAN_INTEN_EPIEN                     CAN_INTEN_EPIEN_Msk                     /*!< Error passive interrupt enable */
#define CAN_INTEN_BOIEN_Pos                 (10U)
#define CAN_INTEN_BOIEN_Msk                 (0x1U << CAN_INTEN_BOIEN_Pos)           /*!< 0x00000400 */
#define CAN_INTEN_BOIEN                     CAN_INTEN_BOIEN_Msk                     /*!< Bus-off interrupt enable */
#define CAN_INTEN_ETRIEN_Pos                (11U)
#define CAN_INTEN_ETRIEN_Msk                (0x1U << CAN_INTEN_ETRIEN_Pos)          /*!< 0x00000800 */
#define CAN_INTEN_ETRIEN                    CAN_INTEN_ETRIEN_Msk                    /*!< Error type record interrupt enable */
#define CAN_INTEN_EOIEN_Pos                 (15U)
#define CAN_INTEN_EOIEN_Msk                 (0x1U << CAN_INTEN_EOIEN_Pos)           /*!< 0x00008000 */
#define CAN_INTEN_EOIEN                     CAN_INTEN_EOIEN_Msk                     /*!< Error occur interrupt enable */
#define CAN_INTEN_QDZIEN_Pos                (16U)
#define CAN_INTEN_QDZIEN_Msk                (0x1U << CAN_INTEN_QDZIEN_Pos)          /*!< 0x00010000 */
#define CAN_INTEN_QDZIEN                    CAN_INTEN_QDZIEN_Msk                    /*!< Quit doze mode interrupt enable */
#define CAN_INTEN_EDZIEN_Pos                (17U)
#define CAN_INTEN_EDZIEN_Msk                (0x1U << CAN_INTEN_EDZIEN_Pos)          /*!< 0x00020000 */
#define CAN_INTEN_EDZIEN                    CAN_INTEN_EDZIEN_Msk                    /*!< Enter doze mode interrupt enable */

/*******************  Bit definition for CAN_ESTS register  *******************/
#define CAN_ESTS_EAF_Pos                    (0U)
#define CAN_ESTS_EAF_Msk                    (0x1U << CAN_ESTS_EAF_Pos)              /*!< 0x00000001 */
#define CAN_ESTS_EAF                        CAN_ESTS_EAF_Msk                        /*!< Error active flag */
#define CAN_ESTS_EPF_Pos                    (1U)
#define CAN_ESTS_EPF_Msk                    (0x1U << CAN_ESTS_EPF_Pos)              /*!< 0x00000002 */
#define CAN_ESTS_EPF                        CAN_ESTS_EPF_Msk                        /*!< Error passive flag */
#define CAN_ESTS_BOF_Pos                    (2U)
#define CAN_ESTS_BOF_Msk                    (0x1U << CAN_ESTS_BOF_Pos)              /*!< 0x00000004 */
#define CAN_ESTS_BOF                        CAN_ESTS_BOF_Msk                        /*!< Bus-off flag */

/*!< ETR congiguration */
#define CAN_ESTS_ETR_Pos                    (4U)
#define CAN_ESTS_ETR_Msk                    (0x7U << CAN_ESTS_ETR_Pos)              /*!< 0x00000070 */
#define CAN_ESTS_ETR                        CAN_ESTS_ETR_Msk                        /*!< ETR[2:0] bits (Error type record) */
#define CAN_ESTS_ETR_0                      (0x1U << CAN_ESTS_ETR_Pos)              /*!< 0x00000010 */
#define CAN_ESTS_ETR_1                      (0x2U << CAN_ESTS_ETR_Pos)              /*!< 0x00000020 */
#define CAN_ESTS_ETR_2                      (0x4U << CAN_ESTS_ETR_Pos)              /*!< 0x00000040 */

